# Series

In [1]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index_s=['a','b','c','d','e']
ser=pd.Series([1,2,3,4,5],index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
ser[0]
#ser[a]

C:\Users\Admin\AppData\Local\Temp\ipykernel_8308\1314631141.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0]

np.int64(1)

In [12]:
dict_data={'a':1,'b':2,'c':3,'d':4}
s3=pd.Series(dict_data)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울','부산']])

9776
서울    9776
부산    2729
dtype: int64

In [16]:
population.info()    #4개의 인덱스 ,최소는 서울 최대는 대구

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [20]:

ser.iloc[0],ser.loc['a']         #숫자인덱스, 인덱스를 가지고 꺼냄

(np.int64(1), np.int64(1))

# 데이터 프레임

In [ ]:
#pd.DataFrame(data,index=[행이름들],columns=[열이름들])

In [17]:
import pandas as pd
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [4]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [5]:
scientists['Name'] #결과는 시리즈

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [6]:
scientists.index=['  Rosaline Franklin',' William Gosset']
scientists.index

Index(['  Rosaline Franklin', ' William Gosset'], dtype='object')

In [7]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [8]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name:  William Gosset, dtype: object

In [18]:
import numpy as np
scientists.loc["William Gosset"]   #인덱스로 행추출

KeyError: 'William Gosset'

In [10]:
scientists.loc['Rosaline Franklin','Born']

KeyError: 'Rosaline Franklin'

In [16]:
#[시작행:끝행, 시작열:끝열] #쉼표는 행과열 >차원을 구분
scientists.iloc[:, 0:2]

                                 Name    Occupation
 Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset         William Gosset  Statistician

In [51]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object', name='Name')

In [43]:
data=[[1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]]

df=pd.DataFrame(data)
print(df)

#열 이름 지정하여 생성
df=pd.DataFrame(data,columns=['A','B','C'])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
import numpy as np
import pandas as pd

arr=np.array([[1,2,3],
             [4,5,6],
             [7,8,9]])

df=pd.DataFrame(arr,columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [55]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [58]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [29]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [37]:
#iloc로  William gosset age 추출
sci1.iloc[1:,4:5]
#sci1.iloc[1,4]

   Age
1   61

In [41]:
#born,died만 추출
#sci1.iloc[1:,2:4]
sci1.iloc[:,2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [42]:
#occupation만 추출
sci1["Occupation"]

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [63]:
sci1.to_csv('./data/scientist_1.csv')

In [67]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [75]:
#pickle(파이썬의 객체형을 저장)
sci1.to_pickle('./data/scientist.pickle')

In [76]:
df2=pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [69]:
df=pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [73]:
df1=pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.head()   #기본5개

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [80]:
df1.tail()

            Name        Born        Died  Age          Occupation
3    Marie Curie  1867-11-07  1934-07-04   66             Chemist
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.describe()   #기술통계

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [84]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

# 행과 열 이름 바꾸기

In [44]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df
#행 이름 출력 
#print(df.index)

#열 이름 출력
#print(df.columns)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [47]:
#행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df

    이름  나이  점수
A  김철수  25  85
B  이영희  28  92
C  박민수  22  78
D  정수진  31  95
E  최영호  27  88
F  한미래  24  73
G  윤지원  29  91

In [48]:
df.columns=['name','age','score']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [50]:
df.rename(columns={'name':'Name','age':'Age'})

  Name  Age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [49]:
  #열이름 변경
df=df.rename(index={"A":"a", "B":"b"})
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [52]:
df.iloc[0] #행단위는 iloc, 이름단위 loc

name     김철수
age       25
score     85
Name: a, dtype: object

In [54]:
df.iloc[0:2]   #행단위 슬라이싱-1

  name  age  score
a  김철수   25     85
b  이영희   28     92

In [57]:
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [55]:
df[df['age']>25]               ###필터링: 조건을 사용한 행 추출

  name  age  score
b  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [56]:
df[df['score']>=90]   #점수 90점 이상인것만 추출

  name  age  score
b  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [58]:
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [86]:
df.loc[7]=['홍길동',30,70,'H']
#df.iloc[8]=['김길동',20,90]------>iloc로 추가는 불가능
df=df.rename(index={7:'H'})
df

  name  age  score grade
a  김철수   25     85     A
b  이영희   28     92     B
C  박민수   22     78     C
D  정수진   31     95     D
E  최영호   27     88     E
F  한미래   24     73     F
G  윤지원   29     91     G
H  홍길동   30     70     H

In [91]:
#df.append([8,'박나래',20,50])  --->append불가능
df['grade']=['A','B','C','D','E','F','G','H']
df
#등급으로 열 이름 변경
df.rename(columns={'grade':'등급'},inplace=True)
df

  name  age  score 등급
a  김철수   25     85  A
b  이영희   28     92  B
C  박민수   22     78  C
D  정수진   31     95  D
E  최영호   27     88  E
F  한미래   24     73  F
G  윤지원   29     91  G
H  홍길동   30     70  H

In [104]:
# insert() 메서드로 특정 위치에 열 추가
#df.insert(loc=1, column='s_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007','5008'])
df['s_id'] = ['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008']   #예전작업하던거중 s_id중복해서 덮어쓰기
df

  name  s_id student_id  age  score 등급
a  김철수  S001       S001   25     85  A
b  이영희  S002       S002   28     92  B
C  박민수  S003       S003   22     78  C
D  정수진  S004       S004   31     95  D
E  최영호  S005       S005   27     88  E
F  한미래  S006       S006   24     73  F
G  윤지원  S007       S007   29     91  G
H  홍길동  S008       5008   30     70  H

In [116]:
df1=df.drop('a',axis=0)
df1
            #첫번째행, 인덱스a부분 삭제

  name  s_id student_id  age  score 등급
b  이영희  S002       S002   28     92  B
C  박민수  S003       S003   22     78  C
D  정수진  S004       S004   31     95  D
E  최영호  S005       S005   27     88  E
F  한미래  S006       S006   24     73  F
G  윤지원  S007       S007   29     91  G
H  홍길동  S008       5008   30     70  H

In [130]:
# 여러 행 한 번에 삭제
df1.drop(['b', 'C'], axis=0)
df1

  name  s_id student_id  age  score 등급
b  이영희  S002       S002   28     92  B
C  박민수  S003       S003   22     78  C
D  정수진  S004       S004   31     95  D
E  최영호  S005       S005   27     88  E
F  한미래  S006       S006   24     73  F
G  윤지원  S007       S007   29     91  G
H  홍길동  S008       5008   30     70  H

In [129]:
df1

  name  s_id student_id  age  score 등급
b  이영희  S002       S002   28     92  B
C  박민수  S003       S003   22     78  C
D  정수진  S004       S004   31     95  D
E  최영호  S005       S005   27     88  E
F  한미래  S006       S006   24     73  F
G  윤지원  S007       S007   29     91  G
H  홍길동  S008       5008   30     70  H

In [131]:
df1.drop('등급',axis=1)

  name  s_id student_id  age  score
b  이영희  S002       S002   28     92
C  박민수  S003       S003   22     78
D  정수진  S004       S004   31     95
E  최영호  S005       S005   27     88
F  한미래  S006       S006   24     73
G  윤지원  S007       S007   29     91
H  홍길동  S008       5008   30     70

In [138]:
#'등급'열 다시생성
df1['등급']=['A','B','C','D','E','F','G']
df1

  name  s_id student_id  age  score 등급 grade
b  이영희  S002       S002   28     92  A     A
C  박민수  S003       S003   22     78  B     B
D  정수진  S004       S004   31     95  C     C
E  최영호  S005       S005   27     88  D     D
F  한미래  S006       S006   24     73  E     E
G  윤지원  S007       S007   29     91  F     F
H  홍길동  S008       5008   30     70  G     G

In [144]:
df_new=df1.set_index('s_id')
df_new.index

Index(['S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='s_id')

In [146]:
# 인덱스를 다시 열로 되돌리기
df_new.reset_index(inplace=True)
df_new

   index  s_id name student_id  age  score 등급 grade
0      0  S002  이영희       S002   28     92  A     A
1      1  S003  박민수       S003   22     78  B     B
2      2  S004  정수진       S004   31     95  C     C
3      3  S005  최영호       S005   27     88  D     D
4      4  S006  한미래       S006   24     73  E     E
5      5  S007  윤지원       S007   29     91  F     F
6      6  S008  홍길동       5008   30     70  G     G

In [154]:
dr=pd.date_range('2025-06-01',periods=7)
df_new['date']=dr
dr

DatetimeIndex(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
               '2025-06-05', '2025-06-06', '2025-06-07'],
              dtype='datetime64[ns]', freq='D')

In [152]:
df_new1=df_new.set_index('date')
df_new1

            index  s_id name student_id  age  score 등급 grade
date
2025-06-01      0  S002  이영희       S002   28     92  A     A
2025-06-02      1  S003  박민수       S003   22     78  B     B
2025-06-03      2  S004  정수진       S004   31     95  C     C
2025-06-04      3  S005  최영호       S005   27     88  D     D
2025-06-05      4  S006  한미래       S006   24     73  E     E
2025-06-06      5  S007  윤지원       S007   29     91  F     F
2025-06-07      6  S008  홍길동       5008   30     70  G     G

In [ ]:
.